/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 1. 项目名称：豪客微信站
 2. 文件名称：static/jssrc/personal/index.js --> (个人中心/首页)
 3. 作者：KingsleyYu
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

function IndexController(){
    Controller.call(this)
}

IndexController.prototype.bindEvent=function(){
    var classSelf=this;
}

$(function(){
    new IndexController()
})